# Str2Num

## Description
Function Str2Num returns the specified string as a numeric value.

```pascal
FUNCTION Str2Num(s : STRING) : REAL;
```

```python

def vs.Str2Num(s):
    return REAL
```

## Parameters
|Name|Type|Description|
|---|---|---|
|s|STRING|Source string.|

## Examples
```pascal
numValue:=Str2Num('235.44');

```

## See Also
VS Functions:
ValidNumStr

## Version
Availability: from MiniCAD
## Category
* Strings